In [2]:
# importing required libraries
import pandas as pd
import re
df = pd.read_csv('products.csv')

In [2]:
# checking for null values
df.isnull().sum()

product_id       0
product_name     0
price            0
category_id      0
class            0
modify_date      0
resistant        0
is_allergic      0
vitality_days    0
dtype: int64

In [3]:
#converting column headers to snake case 
df.columns = df.columns.str.lower()# make them lower case
df.columns = df.columns.str.replace(' ','_') # add _ instead of space
df = df.rename(columns={'purchase_amount_(usd)':'purchase_amount'}) # aplly changes

In [4]:
#formatting date
df['modify_date'] = pd.to_datetime(df['modify_date'])#converting to datetime object
df['modify_date'] = df['modify_date'].dt.strftime('%Y-%m-%d')# simple

In [5]:
# rounding up the price column
df['price'] = df['price'].round(1)

In [6]:
df.head()

,product_id,product_name,price,category_id,class,modify_date,resistant,is_allergic,vitality_days
0,1,Flour - Whole Wheat,74.3,3,Medium,2018-02-16,Durable,Unknown,0.0
1,2,Cookie Chocolate Chip With,91.2,3,Medium,2017-02-12,Unknown,Unknown,0.0
2,3,Onions - Cippolini,9.1,9,Medium,2018-03-15,Weak,False,111.0
3,4,"Sauce - Gravy, Au Jus, Mix",54.3,9,Medium,2017-07-16,Durable,Unknown,0.0
4,5,Artichokes - Jerusalem,65.5,2,Low,2017-08-16,Durable,True,27.0

In [14]:
# saving changes to the original file
df.to_csv('products.csv',index=False)

In [3]:
# importing sales data
df_sales = pd.read_csv('sales.csv')

In [6]:
df_sales = df_sales.drop(columns=['product_price.1'])

In [7]:
df_sales.head()

,sale_id,sales_person_id,customer_id,product_id,quantity,product_price,gross_price,discount,net_price,sales_date,transaction_number
0,1,6,27039,381,7,44.2,309.4,0.0,309.40,2018-02-05,FQL4S94E4ME1EZFTG42G
1,2,16,25011,61,7,62.6,438.2,0.0,438.20,2018-02-02,12UGLX40DJ1A5DTFBHB8
2,3,13,94024,23,24,79.0,1896.0,0.0,1896.00,2018-05-03,5DT8RCPL87KI5EORO7B0
3,4,8,73966,176,19,81.3,1544.7,0.2,1235.76,2018-04-07,R3DR9MLD5NR76VO17ULE
4,5,10,32653,310,9,80.0,720.0,0.0,720.00,2018-02-12,4BGS0Z5OMAZ8NDAFHHP3

In [3]:
#checking for null values
df_sales.isnull().sum()

sale_id               0
sales_person_id       0
customer_id           0
product_id            0
quantity              0
product_price         0
product_price.1       0
gross_price           0
discount              0
net_price             0
sales_date            0
transaction_number    0
dtype: int64

In [10]:
# row count
print(df_sales.shape[0])

6690599

In [11]:
# coverting column headers to snake case
def to_snake_case(name):
    s1 = re.sub(r'(.)([A-Z])', r'\1_\2', name)#inserts an underscore (_) before every capital letter (except the very first) to separate the words
    return s1.lower()

original_col = df_sales.columns.tolist()
snake_case_col = [to_snake_case(col) for col in original_col]

df_sales.columns = snake_case_col

In [12]:
# formatting sales date
df_sales['sales_date'] = pd.to_datetime(df_sales['sales_date'])#converting to datetime object
df_sales['sales_date'] = df_sales['sales_date'].dt.strftime('%Y-%m-%d')# simple

In [13]:
#droping rows where sales date is not mentioned
df_sales = df_sales.dropna(subset=['sales_date'])

In [14]:
df_sales.head()

,sales_id,sales_person_id,customer_id,product_id,quantity,product_price,gross_price,discount,net_price,sales_date,transaction_number
0,1,6,27039,381,7,44.2,309.4,0.0,309.40,2018-02-05,FQL4S94E4ME1EZFTG42G
1,2,16,25011,61,7,62.6,438.2,0.0,438.20,2018-02-02,12UGLX40DJ1A5DTFBHB8
2,3,13,94024,23,24,79.0,1896.0,0.0,1896.00,2018-05-03,5DT8RCPL87KI5EORO7B0
3,4,8,73966,176,19,81.3,1544.7,0.2,1235.76,2018-04-07,R3DR9MLD5NR76VO17ULE
4,5,10,32653,310,9,80.0,720.0,0.0,720.00,2018-02-12,4BGS0Z5OMAZ8NDAFHHP3

In [15]:
# Adding price column to sales dataframe
df_sales = pd.merge(           #combining dataframes on commonkey
    df_sales,
    df[['product_id','price']],
    on = 'product_id',
    how = 'left'
)
# Reordering the column 
quantity_index = df_sales.columns.get_loc('quantity')

cols = df_sales.columns.to_list() # converting column into a list

cols.insert(quantity_index + 1 , cols.pop(cols.index('price'))) # specifing postion

In [16]:
# apllying the ordered lsit
df_sales = df_sales[cols]

In [17]:
df_sales.head()

,sales_id,sales_person_id,customer_id,product_id,quantity,price,product_price,gross_price,discount,net_price,sales_date,transaction_number
0,1,6,27039,381,7,44.2,44.2,309.4,0.0,309.40,2018-02-05,FQL4S94E4ME1EZFTG42G
1,2,16,25011,61,7,62.6,62.6,438.2,0.0,438.20,2018-02-02,12UGLX40DJ1A5DTFBHB8
2,3,13,94024,23,24,79.0,79.0,1896.0,0.0,1896.00,2018-05-03,5DT8RCPL87KI5EORO7B0
3,4,8,73966,176,19,81.3,81.3,1544.7,0.2,1235.76,2018-04-07,R3DR9MLD5NR76VO17ULE
4,5,10,32653,310,9,80.0,80.0,720.0,0.0,720.00,2018-02-12,4BGS0Z5OMAZ8NDAFHHP3

In [18]:
# calculating gross price

df_sales.rename(columns={'price': 'product_price'}, inplace=True)# Rename price to product_price

df_sales['gross_price'] = (df_sales['quantity'] * df_sales['product_price']).round(2)#Calculating gross price and rounding up

df_sales.drop(columns=['total_price'], inplace=True)# Droping the total_price column

# Reordering columns

cols = df_sales.columns.tolist()#column list

product_price_index = cols.index('product_price')#position of product_price

cols.insert(product_price_index + 1,
            cols.pop(cols.index('gross_price')))# Move gross_price to right after product_price

# Applying the new column order
df_sales = df_sales[cols]

ValueError: cannot reindex on an axis with duplicate labels

In [ ]:
# calculating net price by multiplying gross_price with discount

df_sales['net_price'] = (df_sales['gross_price'] * (1-df_sales['discount'])).round(2)

# reordering columns
cols_2 = df_sales.columns.tolist()

discount_index = cols_2.index('discount')

cols_2.insert(discount_index + 1,
             cols_2.pop(cols_2.index('net_price')))

# apllying new column order
df_sales = df_sales[cols_2]

In [21]:
df_sales.rename(columns={'sales_id': 'sale_id'}, inplace=True)

In [22]:
df_sales.head()

,sale_id,sales_person_id,customer_id,product_id,quantity,product_price,product_price,gross_price,discount,net_price,sales_date,transaction_number
0,1,6,27039,381,7,44.2,44.2,309.4,0.0,309.40,2018-02-05,FQL4S94E4ME1EZFTG42G
1,2,16,25011,61,7,62.6,62.6,438.2,0.0,438.20,2018-02-02,12UGLX40DJ1A5DTFBHB8
2,3,13,94024,23,24,79.0,79.0,1896.0,0.0,1896.00,2018-05-03,5DT8RCPL87KI5EORO7B0
3,4,8,73966,176,19,81.3,81.3,1544.7,0.2,1235.76,2018-04-07,R3DR9MLD5NR76VO17ULE
4,5,10,32653,310,9,80.0,80.0,720.0,0.0,720.00,2018-02-12,4BGS0Z5OMAZ8NDAFHHP3

In [23]:
df_sales['net_price'].describe()

count    6.690599e+06
mean     6.410663e+02
std      5.470737e+02
min      0.000000e+00
25%      1.806000e+02
50%      4.908000e+02
75%      9.840000e+02
max      2.497500e+03
Name: net_price, dtype: float64

In [8]:
#saving changes to the original file
df_sales.to_csv('sales.csv',index=False)

In [3]:
# working with category table
df_ca = pd.read_csv('categories.csv')

In [4]:
# formatting column names to snake case
df_ca.columns = df_ca.columns.str.lower()
df_ca.columns = df_ca.columns.str.replace(' ','_')

In [5]:
#saving changes to the original csv file
df_ca.to_csv('categories.csv',index=False)

Index(['category_id', 'category_name'], dtype='object')

In [7]:
#working with cities table
df_ct = pd.read_csv('cities.csv')

In [9]:
# formatting column names to snake case
df_ct.columns = df_ct.columns.str.lower()
df_ct.columns = df_ct.columns.str.replace(' ','_')

In [13]:
#saving changes to the original csv file
df_ct.to_csv('cities.csv',index=False)

In [14]:
# working with countries table
df_co = pd.read_csv('countries.csv')

In [19]:
# formatting column names to snake case
df_co.columns = df_co.columns.str.lower()
df_co.columns = df_co.columns.str.replace(' ','_')

In [20]:
df_co.head()

   country_id country_name country_code
0           1      Armenia           AN
1           2       Canada           FO
2           3       Belize           MK
3           4       Uganda           LV
4           5     Thailand           VI

In [21]:
#saving changes to the original csv file
df_co.to_csv('countries.csv',index=False)

In [9]:
# working with customers table
df_cus = pd.read_csv('customers.csv')

In [25]:
# formatting column names to snake case
df_cus.columns = df_cus.columns.str.lower()
df_cus.columns = df_cus.columns.str.replace(' ','_')

In [26]:
df_cus.head()

,customer_id,first_name,middle_initial,last_name,city_id,address
0,1,Stefanie,Y,Frye,79,97 Oak Avenue
1,2,Sandy,T,Kirby,96,52 White First Freeway
2,3,Lee,T,Zhang,55,921 White Fabien Avenue
3,4,Regina,S,Avery,40,75 Old Avenue
4,5,Daniel,S,Mccann,2,283 South Green Hague Avenue

In [7]:
#saving changes to the original csv file
df_cus.to_csv('customers.csv',index=False)

NameError: name 'df_cus' is not defined

In [20]:
#working with employees table
df_emp = pd.read_csv('employees.csv')

In [29]:
# formatting column names to snake case
df_emp.columns = df_emp.columns.str.lower()
df_emp.columns = df_emp.columns.str.replace(' ','_')

In [5]:
# coverting column headers to snake case
def to_snake_case(name):
    s1 = re.sub(r'(.)([A-Z])', r'\1_\2', name)#inserts an underscore (_) before every capital letter (except the very first) to separate the words
    return s1.lower()

original_col = df_emp.columns.tolist()
snake_case_col = [to_snake_case(col) for col in original_col]

df_emp.columns = snake_case_col

In [7]:
# formatting hire date
df_emp['hire_date'] = pd.to_datetime(df_emp['hire_date']) # converting to datetime obeject
df_emp['hire_date'] = df_emp['hire_date'].dt.strftime('%Y-%m-%d')# simple

In [9]:
# formatting hire date
df_emp['birth_date'] = pd.to_datetime(df_emp['birth_date']) # converting to datetime obeject
df_emp['birth_date'] = df_emp['birth_date'].dt.strftime('%Y-%m-%d')# simple

In [10]:
df_emp.head()

,employee_id,first_name,middle_initial,last_name,birth_date,gender,city_id,hire_date
0,1,Nicole,T,Fuller,1981-03-07,F,80,2011-06-20
1,2,Christine,W,Palmer,1968-01-25,F,4,2011-04-27
2,3,Pablo,Y,Cline,1963-02-09,M,70,2012-03-30
3,4,Darnell,O,Nielsen,1989-02-06,M,39,2014-03-06
4,5,Desiree,L,Stuart,1963-05-03,F,23,2014-11-16

In [17]:
# calculating employee age
from datetime import date

df_emp['birth_date'] = pd.to_datetime(df_emp['birth_date'])
today = pd.to_datetime(date.today()) # fecthing today's date

df_emp['age'] = ((today - df_emp['birth_date']).dt.days/365.25).astype(int) # subtracting today's date woth birth date

# reordering the columns
birth_date_index = df_emp.columns.get_loc('birth_date') # index position stored
cols = df_emp.columns.tolist() # list of columns

#insert the column right next to birth_date
cols.insert(birth_date_index + 1, cols.pop(cols.index('age')))
df_emp = df_emp[cols]

In [18]:
df_emp.head()

,employee_id,first_name,middle_initial,last_name,birth_date,age,gender,city_id,hire_date
0,1,Nicole,T,Fuller,1981-03-07,44,F,80,2011-06-20
1,2,Christine,W,Palmer,1968-01-25,57,F,4,2011-04-27
2,3,Pablo,Y,Cline,1963-02-09,62,M,70,2012-03-30
3,4,Darnell,O,Nielsen,1989-02-06,36,M,39,2014-03-06
4,5,Desiree,L,Stuart,1963-05-03,62,F,23,2014-11-16

In [20]:
#saving changes to the original csv file
df_emp.to_csv('employees.csv',index=False)